app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT "documents".* FROM "documents"