app/controllers/smschongzhirecords_controller.rb

  def index
      @smschongzhirecords =Smschongzhirecord.where("user_id=?",current_user.id)
---
SELECT "smschongzhirecords".* FROM "smschongzhirecords" WHERE (user_id=2)