app/controllers/smslogrecords_controller.rb

SELECT "smslogrecords".* FROM "smslogrecords" WHERE (user_id=2)  ORDER BY id desc
---
  def index
    @smslogrecords = Smslogrecord.where("user_id=?",current_user.id).order("id desc")