app/controllers/smstags_controller.rb

SELECT "smstags".* FROM "smstags"
---
  def index
    @smstags = Smstag.all

INSERT INTO "smstags" ("name", "price", "mobid", "mobno", "laiyuan", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "teee"], ["price", 0], ["mobid", 0], ["mobno", ""], ["laiyuan", ""], ["created_at", "2016-07-22 07:30:57.134592"], ["updated_at", "2016-07-22 07:30:57.134592"]]
---
  def create
    @smstag = Smstag.new(smstag_params)

    respond_to do |format|
      if @smstag.save and current_user

UPDATE "smstags" SET "price" = ?, "mobid" = ?, "updated_at" = ? WHERE "smstags"."id" = ?  [["price", 0], ["mobid", 0], ["updated_at", "2016-07-22 07:31:01.252734"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @smstag.update(smstag_params)

SELECT  "smstags".* FROM "smstags" WHERE "smstags"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_smstag
      @smstag = Smstag.find(params[:id])