app/controllers/yuehuis_controller.rb

SELECT "yuehuis".* FROM "yuehuis"
---
  def index
    @yuehuis = Yuehui.all

UPDATE "yuehuis" SET "tel" = ?, "updated_at" = ? WHERE "yuehuis"."id" = ?  [["tel", "15779909799"], ["updated_at", "2015-08-11 16:55:04.419298"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @yuehui.update(yuehui_params)

SELECT  "yuehuis".* FROM "yuehuis" WHERE "yuehuis"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_yuehui
      @yuehui = Yuehui.find(params[:id])