app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "2100803@qq.com"]]
---
 def create
       ##验证邮箱是否存在
   user = User.find_for_database_authentication(:email => params[:user][:email])